In [4]:
#important point of numpy and pandas

#in numpy axis 0 is column
              #1 is row
    
#in pandas axis 0 is rows
               #1 is column

In [13]:
pip install  pandas

Collecting pandas
  Downloading pandas-1.4.2-cp310-cp310-win_amd64.whl (10.6 MB)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\admin\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\admin\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.22.3)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pandas
Successfully installed pandas-1.4.2
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.2.4; however, version 22.0.4 is available.
You should consider upgrading via the 'C:\Users\ADMIN\AppData\Local\Programs\Python\Python310\python.exe -m pip install --upgrade pip' command.

# Working With Series Data Structures

# Q-1)

## A teacher wishes to store the names of the students along with their roll numbers or serial numbers in the proper format. How can you help the teacher to accomplish this task? How will Series help you solve it?

In [11]:
name = ["John", "Smith", "Warner", "David", "Micheal", "James", "Dennis","Rossum"]

In [84]:
import pandas as pd

In [151]:
S = pd.Series(name) # Series is a single column table structure available in the pandas library 
S 
# Note : The row id's are auto generated, they represent the student roll number in this example

0    Benjamin
1        Liam
2        John
3       Smith
4      Warner
5       David
6     Micheal
7       James
8      Dennis
9      Rossum
dtype: object

In [154]:
# Setting custom row index , here we want the row index to be begin with 1 
import numpy as np
S1 = pd.Series(S, index=np.arange(1,9)) # The index object has data(numerical values) from 1 to 9
S1

1       Liam
2       John
3      Smith
4     Warner
5      David
6    Micheal
7      James
8     Dennis
dtype: object

# Q-2)

## An e-commerce company wants to represent the customer IDs which consist of alphanumeric characters, with their spending scores (1-100). How can you accomplish this task?

In [87]:
cust_id = ["A1","A2","A3","A4","A5"] # The row index can be non numerical 
spnd_scr = [55,65,90,79,88]
S2 = pd.Series(spnd_scr, index = cust_id)
S2

A1    55
A2    65
A3    90
A4    79
A5    88
dtype: int64

# Q-3)

## Converting a dictionary object into Series type

In [88]:
dic = {'Roll_no':44, 'Name':"Macculam", 'Marks':87, 'Age':12}
S3 = pd.Series(dic)
S3

Roll_no          44
Name       Macculam
Marks            87
Age              12
dtype: object

# Q-4)

## Tabular representation of the names and salaries of employees in a startup, using Series

In [89]:
name = ["Benjamin","Liam","John", "Smith", "Warner", "David", "Micheal", "James", "Dennis","Rossum"]
Sal = [25000, 26000, 23000, 27000, 28000, 28500, 24000, 30000, 29000, 24700]
Ser = pd.Series(Sal, index=name)
Ser

# Note : The first column containing the Name of the employees is the row index of Series

Benjamin    25000
Liam        26000
John        23000
Smith       27000
Warner      28000
David       28500
Micheal     24000
James       30000
Dennis      29000
Rossum      24700
dtype: int64

# Q-5)

## How can you retrieve the first five elements and the last three elements from the above data?

In [90]:
print("First five elements of series are:\n", Ser[:5])

First five elements of series are:
 Benjamin    25000
Liam        26000
John        23000
Smith       27000
Warner      28000
dtype: int64

In [91]:
print("Last three elements of series are:\n", Ser[7:])

Last three elements of series are:
 James     30000
Dennis    29000
Rossum    24700
dtype: int64

In [92]:
print("Last three elements of series are:\n", Ser[-3:])

Last three elements of series are:
 James     30000
Dennis    29000
Rossum    24700
dtype: int64

## Consider the series "S2" that represents the Customer ID and Spending score (1-100) of the customers of an e-commerce company. The company wants to know the records of the customers with customer IDs from A3 to A5. How can you accomplish this task?

In [93]:
print("The record of customers who's customer ID is from A3 to A5 is:\n", S2[2:])

The record of customers who's customer ID is from A3 to A5 is:
 A3    90
A4    79
A5    88
dtype: int64

# Q-6)

## Consider the series "S1" that represents the names and serial numbers of students. A teacher wants to find out the the records of the students having serial number more than 4 and less than 8. How can you accomplish this task?

In [94]:
print(S1[4:7])

5    Micheal
6      James
7     Dennis
dtype: object

# Q-7)

## Consider the series "Ser", that represents the names and annual salaries of the employees of the company.  Display the records of the employees whose salary is greater than 27,000.

In [95]:
Ser # Print the original data

Benjamin    25000
Liam        26000
John        23000
Smith       27000
Warner      28000
David       28500
Micheal     24000
James       30000
Dennis      29000
Rossum      24700
dtype: int64

In [96]:
# Alternate approach 
Ser[Ser > 27000] # applying the filter condition

Warner    28000
David     28500
James     30000
Dennis    29000
dtype: int64

# Q-8)

## Consider the series "Ser", that represents the names and annual salaries of the employees of the company. A company wants to find out the names of the employees whose salary is more than 26,000 USD and less than 29,000 USD. How can you accomplish this task?

In [97]:
x = Ser[(Ser > 26000) & (Ser < 29000)]
x

Smith     27000
Warner    28000
David     28500
dtype: int64

In [98]:
x.index # Would identify the row index from the result saled in "x"

Index(['Smith', 'Warner', 'David'], dtype='object')

In [99]:
type(x) # A subset of a series would result in a series type !

pandas.core.series.Series

# Q-9)

## With respect to the series object,  "Ser", the company wants to increase the salary of all the employees by 20%.  Display the records of the employees whose updated salary is greater than 32,000 USD.

In [100]:
Ser # Printing the original data

Benjamin    25000
Liam        26000
John        23000
Smith       27000
Warner      28000
David       28500
Micheal     24000
James       30000
Dennis      29000
Rossum      24700
dtype: int64

In [101]:
Ser = Ser * 1.20 # Increasing the salary column by 20% 
Ser # Printing the updated data

Benjamin    30000.0
Liam        31200.0
John        27600.0
Smith       32400.0
Warner      33600.0
David       34200.0
Micheal     28800.0
James       36000.0
Dennis      34800.0
Rossum      29640.0
dtype: float64

In [102]:
Ser[Ser > 32000] # Filtering out the data where salary is greater than 32000

Smith     32400.0
Warner    33600.0
David     34200.0
James     36000.0
Dennis    34800.0
dtype: float64

# Q-10)

## Consider the series object "Ser". Implement the income tax of 6% on the salary field.  Print the tax amount paid by each employee and display the salary after the tax deduction.

In [103]:
Tax = Ser * 0.06
print("The tax amount need to be paid by all employees:\n",Tax)

The tax amount need to be paid by all employees:
 Benjamin    1800.0
Liam        1872.0
John        1656.0
Smith       1944.0
Warner      2016.0
David       2052.0
Micheal     1728.0
James       2160.0
Dennis      2088.0
Rossum      1778.4
dtype: float64

In [104]:
Ser = Ser - Tax
print("After the tax deduction, the net salary of all employees are:\n",Ser)

After the tax deduction, the net salary of all employees are:
 Benjamin    28200.0
Liam        29328.0
John        25944.0
Smith       30456.0
Warner      31584.0
David       32148.0
Micheal     27072.0
James       33840.0
Dennis      32712.0
Rossum      27861.6
dtype: float64

# Q-11)

## Consider the series object "Ser". Identify the top 5 highest paid employees in the data.

In [105]:
#Sorting the salaries in descending order
sort_Sal = Ser.sort_values(ascending=False)
sort_Sal

James       33840.0
Dennis      32712.0
David       32148.0
Warner      31584.0
Smith       30456.0
Liam        29328.0
Benjamin    28200.0
Rossum      27861.6
Micheal     27072.0
John        25944.0
dtype: float64

In [106]:
print("Name and salaries of top 5 highest paid employees:\n", sort_Sal[0:5])

Name and salaries of top 5 highest paid employees:
 James     33840.0
Dennis    32712.0
David     32148.0
Warner    31584.0
Smith     30456.0
dtype: float64

# Q-12)

## The company wants to add 5 more employees with the annual salary of 25000, 27560, 30100, 26890, and 28500 to the existing data in the Ser object.

In [107]:
new_emp = ["Harry","Jack","Thomas", "Sophia", "Amelia"]
new_sal = [25000,27560,30100,26890,28500]
Sr = pd.Series(new_sal, index=new_emp) # Creating a new series object with additional data 
Sr

Harry     25000
Jack      27560
Thomas    30100
Sophia    26890
Amelia    28500
dtype: int64

In [108]:
new_Ser = pd.concat([Ser,Sr])
new_Ser

Benjamin    28200.0
Liam        29328.0
John        25944.0
Smith       30456.0
Warner      31584.0
David       32148.0
Micheal     27072.0
James       33840.0
Dennis      32712.0
Rossum      27861.6
Harry       25000.0
Jack        27560.0
Thomas      30100.0
Sophia      26890.0
Amelia      28500.0
dtype: float64

In [109]:
print("Total number of employees: ",new_Ser.size)

Total number of employees:  15

# Q-13)

## Consider the updated series object "new_Ser" to answer the following question. What is the total CTC and the average salary for all the employees ?

In [110]:
print("The total cost to employee is :",new_Ser.sum())

The total cost to employee is : 437195.6

In [111]:
print("Average salary of all employee is :",new_Ser.mean())

Average salary of all employee is : 29146.373333333333

In [112]:
new_Ser[1:3]

Liam    29328.0
John    25944.0
dtype: float64

# Q-14)

## Identify the employees who are paid below the average salary of all the employees.

In [113]:
avg = new_Ser.mean() # Calculate the average sal
print("Average salary of all employee is :",avg)

Average salary of all employee is : 29146.373333333333

In [114]:
y = new_Ser[new_Ser < avg] # Filtering out the employees below the average salary 
y

Benjamin    28200.0
John        25944.0
Micheal     27072.0
Rossum      27861.6
Harry       25000.0
Jack        27560.0
Sophia      26890.0
Amelia      28500.0
dtype: float64

In [115]:
print(y.index) # Printing only the empoyee names of those who are paid below average 
# Note : The row index of Series object contains the name of the employees in this case !

Index(['Benjamin', 'John', 'Micheal', 'Rossum', 'Harry', 'Jack', 'Sophia',
       'Amelia'],
      dtype='object')

In [116]:
new_Ser.mean()

29146.373333333333

# Q15)

# Identify the employees whose salary lies between 23K and 25K.

In [117]:
bool = new_Ser.between(23000,25000,inclusive = 'both')
bool

Benjamin    False
Liam        False
John        False
Smith       False
Warner      False
David       False
Micheal     False
James       False
Dennis      False
Rossum      False
Harry        True
Jack        False
Thomas      False
Sophia      False
Amelia      False
dtype: bool

In [118]:
new_Ser[bool]

Harry    25000.0
dtype: float64

# Q-16)

## Sort the data in the alphabetical order of the employee names.

In [119]:
new_Ser.sort_index() # we are sorting based on the index since the index contains the employee names

Amelia      28500.0
Benjamin    28200.0
David       32148.0
Dennis      32712.0
Harry       25000.0
Jack        27560.0
James       33840.0
John        25944.0
Liam        29328.0
Micheal     27072.0
Rossum      27861.6
Smith       30456.0
Sophia      26890.0
Thomas      30100.0
Warner      31584.0
dtype: float64

In [120]:
new_Ser.sort_values()

Harry       25000.0
John        25944.0
Sophia      26890.0
Micheal     27072.0
Jack        27560.0
Rossum      27861.6
Benjamin    28200.0
Amelia      28500.0
Liam        29328.0
Thomas      30100.0
Smith       30456.0
Warner      31584.0
David       32148.0
Dennis      32712.0
James       33840.0
dtype: float64

In [121]:
new_Ser.sort_values(ascending=True)

Harry       25000.0
John        25944.0
Sophia      26890.0
Micheal     27072.0
Jack        27560.0
Rossum      27861.6
Benjamin    28200.0
Amelia      28500.0
Liam        29328.0
Thomas      30100.0
Smith       30456.0
Warner      31584.0
David       32148.0
Dennis      32712.0
James       33840.0
dtype: float64

In [122]:
new_Ser.sort_values(ascending=False)

James       33840.0
Dennis      32712.0
David       32148.0
Warner      31584.0
Smith       30456.0
Thomas      30100.0
Liam        29328.0
Amelia      28500.0
Benjamin    28200.0
Rossum      27861.6
Jack        27560.0
Micheal     27072.0
Sophia      26890.0
John        25944.0
Harry       25000.0
dtype: float64

# Q-17)

## Update the salary of employees Benjamin and Warner with a new salary of 25000 and 28000, respectively.

In [123]:
new_Ser.update(pd.Series([25000, 28000], index = ['Benjamin', 'Warner']))
new_Ser

Benjamin    25000.0
Liam        29328.0
John        25944.0
Smith       30456.0
Warner      28000.0
David       32148.0
Micheal     27072.0
James       33840.0
Dennis      32712.0
Rossum      27861.6
Harry       25000.0
Jack        27560.0
Thomas      30100.0
Sophia      26890.0
Amelia      28500.0
dtype: float64

# DataFrame

A tabular data structure comprises of rows and colums. It can be used to store both numerical and categorical data.

In [126]:
data = {"wastage":[420, 380, 390],
        "hours":[50, 40, 45],
       "ai3873y":[28904,29784,234234]}

d = pd.DataFrame(data)
d

   wastage  hours  ai3873y
0      420     50    28904
1      380     40    29784
2      390     45   234234

In [148]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   wastage  3 non-null      int64
 1   hours    3 non-null      int64
 2   ai3873y  3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes

In [149]:
d.loc[2]

wastage       390
hours          45
ai3873y    234234
Name: 2, dtype: int64

# Q-18)

## Converting the series object  "new_Ser" into a data frame 

Note: Series can just hold one column of data whereas a data frame can support multiple columns.

In [ ]:
# Converting series into Dataframe
df = pd.DataFrame(new_Ser, columns = ['Salary']) 
df

In [ ]:
type(df) 
# Note : Data Frames provide more functions to manipulate them, hence widely used in the analysis of 
# structured data

# Q-19)

# Capturing the details of popular mobile phone brands 'Redmi Note 8 pro', 'Samsung Galaxy M12' and 'Nokia N-90' along with the price in dollars and total units sold

In [63]:
#Creating a dictionary
dic = {'Mobile':['Redmi Note 8 pro', 'Samsung Galaxy M12','Nokia N-90'], 'Cost': [200, 160, 300], 
      'Total_sale':[4300, 5400, 3200]}

In [64]:
DF = pd.DataFrame(dic) # We are converting the dictionary object into a tabular structure (data frame)
DF

               Mobile  Cost  Total_sale
0    Redmi Note 8 pro   200        4300
1  Samsung Galaxy M12   160        5400
2          Nokia N-90   300        3200

In [65]:
#Another way of creating a data frame 
Li =[['Redmi Note 8 pro',14999, 4300],['Samsung Galaxy M12',9999, 5400], ['Nokia N-90', 22000, 3200]]
DF1 = pd.DataFrame(Li, columns = ['Mobile','Cost','Total_sale'])
print(DF1)

               Mobile   Cost  Total_sale
0    Redmi Note 8 pro  14999        4300
1  Samsung Galaxy M12   9999        5400
2          Nokia N-90  22000        3200

# Q-20)

# A teacher wants to create a table that contains information about students' roll_no from 1 to 10, student_name, and percentage. How can you accomplish this task using pandas dataframe?

In [60]:
#Create a dictionary
import numpy as np
Di = {'Roll_no':np.arange(1,11), 'Name':["Benjamin","Liam","John", "Smith", "Warner", "David", "Micheal", "James", "Dennis","Rossum"],
     'Percentage':[66.8, 78.9, 56.4, 45.4, 61.5, 75.6, 80.6, 51.78, 85.5, 70.56]}

Student_data = pd.DataFrame(Di)
Student_data

   Roll_no      Name  Percentage
0        1  Benjamin       66.80
1        2      Liam       78.90
2        3      John       56.40
3        4     Smith       45.40
4        5    Warner       61.50
5        6     David       75.60
6        7   Micheal       80.60
7        8     James       51.78
8        9    Dennis       85.50
9       10    Rossum       70.56

# Q-21)

## Accessing Dataframe Elements

## Teacher wants to know the names of all the students of the class.

In [66]:
Student_data.Name # We are specifically accessing only the student name column from the data frame 
# Note : The index column(row id) is autogenerated

0    Benjamin
1        Liam
2        John
3       Smith
4      Warner
5       David
6     Micheal
7       James
8      Dennis
9      Rossum
Name: Name, dtype: object

In [72]:
#Alternate approach to access a specific column name 
#Student_data['Name']
Student_data['Name'].to_frame()

       Name
0  Benjamin
1      Liam
2      John
3     Smith
4    Warner
5     David
6   Micheal
7     James
8    Dennis
9    Rossum

# Q-22)

## Fetching the details of the student whose roll number is 5

In [68]:
Student_data.iloc[4] # iloc is a function which takes the row id as an argument. Row id starts from 
                     # location zero, hence row index 4 refers to the row 5

Roll_no            5
Name          Warner
Percentage      61.5
Name: 4, dtype: object

In [69]:
#Alternate approach to index into a particular row of a data frame 
Student_data.loc[4]  # loc is another function which accepts row index or even row names 

# Note : There are situations where row index would be non-numerical, in such situations loc is used.

Roll_no            5
Name          Warner
Percentage      61.5
Name: 4, dtype: object

# Q-23)

# Fetching the records of students with roll numbers 6, 7, 8 and 9

In [ ]:
Student_data.iloc[5:9]

# Q-24)

## Fetch only the percentage data of the students with roll numbers 3 & 4.

In [ ]:
Student_data.iloc[2:4, 2:] # 2:4 stands for row level details, 2: stands for column level details 

# 2:4 means, fetch the rows between 2 & 4 (exclude 4)
# 2: means, fetch the column starting from 2 onwards with index location zero

In [ ]:
# Alternate approach 
Student_data.loc[[2,3],['Percentage']]  # loc functin can take arguments which are non numerical 
                        # percentage is the name of the column in the data frame 
    
                # 2,3 are numerical values representing row index 
        
#Student_data.loc[2:3]['Percentage']

# Q-25)

# Fetch the name and percentage of students whose roll numbers are 1, 3, 5 and 7.

In [ ]:
Student_data.iloc[1:8:2, 1:3]
                  #1:8:2, means : fetch rows with index starting from 1 to 8 with a gap of 2 numbers
                         #1:3, means :fetch the columns with position 0 to 3 (ignore 3rd column)

In [ ]:
#Alternate approach
Student_data.loc[[1,3,5,7], ['Name','Percentage']]

# Q-26)

## Identify the students who have scored above 70%.

In [ ]:
Student_data[Student_data.Percentage > 70]

In [ ]:
#Alternate approach 
Student_data[Student_data['Percentage'] > 70]

# Q-27)

# Fetch only the roll numbers and names of the students who have scored above 80%.

In [ ]:
F = Student_data[Student_data['Percentage'] > 80]
F.iloc[:, 0:2]

In [ ]:
#Alternate approach
F1 = Student_data[Student_data['Percentage'] > 80]
F1.loc[0:10,['Roll_no','Name']]